In [1]:
name = 'David'
age = 18

In [2]:
names =['David', 'Jane']
ages = [18,22]

In [4]:
idx = names.index('David')
ages[idx]

18

In [6]:
names =['David', 'Jane', 'Max']
ages = [18,22, 25]

for idx, a in enumerate(ages):
    if a > 20:
        print(names[idx])
    #print(idx, a)

Jane
Max

## DataFrame

In [7]:
data = [['David', 18], ['Jane', 22], ['Max', 25]]
import pandas
df = pandas.DataFrame(data)

In [8]:
df

       0   1
0  David  18
1   Jane  22
2    Max  25

In [16]:
df.iloc[2] # [row]

0    Max
1     25
Name: 2, dtype: object

In [17]:
df[0]

0    David
1     Jane
2      Max
Name: 0, dtype: object

In [18]:
df[1]

0    18
1    22
2    25
Name: 1, dtype: int64

In [19]:
df[1] > 20

0    False
1     True
2     True
Name: 1, dtype: bool

In [20]:
df[df[1] > 20]

      0   1
1  Jane  22
2   Max  25

In [21]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [22]:
type(df)

pandas.core.frame.DataFrame

In [23]:
df.columns = ['name', 'gender', 'age']

In [24]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [25]:
df['gender']

0    M
1    F
2    M
3    M
4    F
5    F
Name: gender, dtype: object

In [26]:
df[['name','gender']]

    name gender
0  frank      M
1   mary      F
2    tom      M
3    ted      M
4   jean      F
5   lisa      F

## Series

In [27]:
import pandas as pd
s = pd.Series([21000, 18900, 18000]) 
s

0    21000
1    18900
2    18000
dtype: int64

In [28]:
pd.Series([21000, 18900, 18000], index = ['Iphone', 'Edge S7', 'HTC M1'])

Iphone     21000
Edge S7    18900
HTC M1     18000
dtype: int64

In [29]:
s = pd.Series({'Iphone':21000,'Edge S7':18900,'HTC M1':18000})

In [30]:
s

Edge S7    18900
HTC M1     18000
Iphone     21000
dtype: int64

In [31]:
s[2]

21000

In [32]:
s[1:3]

HTC M1    18000
Iphone    21000
dtype: int64

In [33]:
s['Iphone']

21000

In [34]:
s[['Iphone', 'Edge S7']]

Iphone     21000
Edge S7    18900
dtype: int64

In [35]:
s > 20000

Edge S7    False
HTC M1     False
Iphone      True
dtype: bool

In [36]:
s[s > 20000]

Iphone    21000
dtype: int64

In [37]:
s[s < 20000]

Edge S7    18900
HTC M1     18000
dtype: int64

In [38]:
cheap = s < 20000
cheap

Edge S7     True
HTC M1      True
Iphone     False
dtype: bool

In [39]:
cheap

Edge S7     True
HTC M1      True
Iphone     False
dtype: bool

In [40]:
s[cheap]

Edge S7    18900
HTC M1     18000
dtype: int64

In [44]:
print('old:',s['Iphone'])
s['Iphone'] =  20000

print('new:',s['Iphone'])

old: 21000
new: 20000

In [45]:
s

Edge S7    18900
HTC M1     18000
Iphone     20000
dtype: int64

In [48]:
type(s)

pandas.core.series.Series

In [46]:
s * 0.8

Edge S7    15120.0
HTC M1     14400.0
Iphone     16000.0
dtype: float64

In [49]:
a =  [100,200,300]
print(a*0.8)

TypeError: can't multiply sequence by non-int of type 'float'

In [50]:
s[s<20000] = s[s<20000] * 0.8

In [51]:
s

Edge S7    15120
HTC M1     14400
Iphone     20000
dtype: int64

In [52]:
s

Edge S7    15120
HTC M1     14400
Iphone     20000
dtype: int64

In [53]:
'Iphone' in s

True

In [54]:
'Mi' in s

False

In [56]:
'Iphone' in s

True

In [57]:
s

Edge S7    15120
HTC M1     14400
Iphone     20000
dtype: int64

In [59]:
s.max()

20000

In [60]:
s.min()

14400

In [61]:
s.mean()

16506.666666666668

In [62]:
s.std()

3046.6593727119107

In [63]:
s.describe()

count        3.000000
mean     16506.666667
std       3046.659373
min      14400.000000
25%      14760.000000
50%      15120.000000
75%      17560.000000
max      20000.000000
dtype: float64

In [65]:
s[['Iphone', 'HTC M1']]

Iphone    20000
HTC M1    14400
dtype: int64

In [66]:
s[['mi', 'HTC M1']]

mi            NaN
HTC M1    14400.0
dtype: float64

In [68]:
s2 = s[['Iphone', 'HTC M1']] + s[['mi', 'HTC M1']]

In [69]:
s2

HTC M1    28800.0
Iphone        NaN
mi            NaN
dtype: float64

In [70]:
s2.notnull()

HTC M1     True
Iphone    False
mi        False
dtype: bool

In [71]:
s2.isnull()

HTC M1    False
Iphone     True
mi         True
dtype: bool

In [73]:
#dir(s)

## DataFrame

In [74]:
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df.columns = ['name', 'gender', 'age']
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [76]:
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]], columns = ['name', 'gender', 'age'])
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [77]:
df = pd.DataFrame([{'name':'frank', 'gender':'M', 'age':29}, \
                   {'name':'mary',  'gender':'F', 'age':23}, \
                   {'name':'tom',   'gender':'M', 'age':35}, \
                   {'name':'ted',   'gender':'M', 'age':33}, \
                   {'name':'jean',  'gender':'F', 'age':21}, \
                   {'name':'lisa',  'gender':'F', 'age':20}])

In [78]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [79]:
df = pd.DataFrame([{'name':'frank', 'gender':'M', 'age':29}, \
                   {'name':'mary',  'gender':'F', 'age':23}, \
                   {'name':'tom',   'gender':'M', 'age':35, 'position':'employee'}, \
                   {'name':'ted',   'gender':'M', 'age':33}, \
                   {'name':'jean',  'gender':'F', 'age':21}, \
                   {'name':'lisa',  'gender':'F', 'age':20}])

In [81]:
df

   age gender   name  position
0   29      M  frank       NaN
1   23      F   mary       NaN
2   35      M    tom  employee
3   33      M    ted       NaN
4   21      F   jean       NaN
5   20      F   lisa       NaN

In [82]:
?df.ix

In [84]:
df.ix[1]

age           23
gender         F
name        mary
position     NaN
Name: 1, dtype: object

In [86]:
df.ix[2:4]

   age gender  name  position
2   35      M   tom  employee
3   33      M   ted       NaN
4   21      F  jean       NaN

In [88]:
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [90]:
df[['name', 'age']]

    name  age
0  frank   29
1   mary   23
2    tom   35
3    ted   33
4   jean   21
5   lisa   20

In [91]:
df.ix[1:2][['name', 'age']]

   name  age
1  mary   23
2   tom   35

In [93]:
df['gender'] == 'M'

0     True
1    False
2     True
3     True
4    False
5    False
Name: gender, dtype: bool

In [95]:
df[df['gender'] == 'M']

   age gender   name  position
0   29      M  frank       NaN
2   35      M    tom  employee
3   33      M    ted       NaN

In [96]:
df[(df['gender'] == 'M') & (df['age'] >= 30) ]

   age gender name  position
2   35      M  tom  employee
3   33      M  ted       NaN

In [97]:
df[(df['gender'] == 'M') | (df['age'] >= 30) ]

   age gender   name  position
0   29      M  frank       NaN
2   35      M    tom  employee
3   33      M    ted       NaN

In [98]:
df.head()

   age gender   name  position
0   29      M  frank       NaN
1   23      F   mary       NaN
2   35      M    tom  employee
3   33      M    ted       NaN
4   21      F   jean       NaN

In [99]:
df.head(3)

   age gender   name  position
0   29      M  frank       NaN
1   23      F   mary       NaN
2   35      M    tom  employee

In [100]:
df.tail()

   age gender  name  position
1   23      F  mary       NaN
2   35      M   tom  employee
3   33      M   ted       NaN
4   21      F  jean       NaN
5   20      F  lisa       NaN

In [102]:
df.tail(2)

   age gender  name position
4   21      F  jean      NaN
5   20      F  lisa      NaN

In [104]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
age         6 non-null int64
gender      6 non-null object
name        6 non-null object
position    1 non-null object
dtypes: int64(1), object(3)
memory usage: 272.0+ bytes

In [106]:
df.describe()

             age
count   6.000000
mean   26.833333
std     6.400521
min    20.000000
25%    21.500000
50%    26.000000
75%    32.000000
max    35.000000

In [109]:
df.dtypes

age          int64
gender      object
name        object
position    object
dtype: object

In [111]:
df

   age gender   name  position
0   29      M  frank       NaN
1   23      F   mary       NaN
2   35      M    tom  employee
3   33      M    ted       NaN
4   21      F   jean       NaN
5   20      F   lisa       NaN

In [112]:
df['employee'] = True

In [114]:
df['full_gender'] = df['gender'].map(lambda e: 'Male' if e=='M' else 'Female')

In [116]:
df

   age gender   name  position employee full_gender
0   29      M  frank       NaN     True        Male
1   23      F   mary       NaN     True      Female
2   35      M    tom  employee     True        Male
3   33      M    ted       NaN     True        Male
4   21      F   jean       NaN     True      Female
5   20      F   lisa       NaN     True      Female

In [117]:
del df['employee']

In [118]:
df

   age gender   name  position full_gender
0   29      M  frank       NaN        Male
1   23      F   mary       NaN      Female
2   35      M    tom  employee        Male
3   33      M    ted       NaN        Male
4   21      F   jean       NaN      Female
5   20      F   lisa       NaN      Female

In [120]:
df = df.drop('full_gender', 1)

In [123]:
del df['position']
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [124]:
df.loc[6] = {'age':20,'gender':'F','name':'qoo'}

In [125]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa
6   20      F    qoo

In [126]:
df.drop(6)

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [129]:
df['userid'] = range(101,108)

In [130]:
df

   age gender   name  userid
0   29      M  frank     101
1   23      F   mary     102
2   35      M    tom     103
3   33      M    ted     104
4   21      F   jean     105
5   20      F   lisa     106
6   20      F    qoo     107

In [131]:
df.set_index('userid', inplace=True)

In [132]:
df

        age gender   name
userid
101      29      M  frank
102      23      F   mary
103      35      M    tom
104      33      M    ted
105      21      F   jean
106      20      F   lisa
107      20      F    qoo

In [136]:
df.iloc[1]

age         23
gender       F
name      mary
Name: 102, dtype: object

In [137]:
df.iloc[1:3]

        age gender  name
userid
102      23      F  mary
103      35      M   tom

In [138]:
df.iloc[[1,3,5]]

        age gender  name
userid
102      23      F  mary
104      33      M   ted
106      20      F  lisa

In [139]:
df.loc[[101,103,105]]

        age gender   name
userid
101      29      M  frank
103      35      M    tom
105      21      F   jean

## Pandas IO

In [140]:
m_cols = ['Time','Action','User','Product', 'Quantity','Price']
orders = pd.read_csv('data/purchase_order.tab', sep='\t',
            parse_dates={'Dates': [0]},names=m_cols, encoding='utf-8')

In [143]:
orders.dropna().describe()

           Quantity          Price
count  54721.000000   54721.000000
mean       1.182270    2012.118803
std        0.803547    6664.332658
min        1.000000      10.000000
25%        1.000000     599.000000
50%        1.000000     899.000000
75%        1.000000    1680.000000
max       30.000000  438888.000000

In [148]:
a = orders.describe()
a.to_json('123.json')

C:\Anaconda32\lib\site-packages\numpy\lib\function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

In [149]:
orders.to_excel('orders.xlsx')

In [150]:
import pandas
df2 = pandas.read_clipboard()

In [151]:
df2

   Action          User         Product  Quantity  Price
0   order    U312622727     P0006944501         1   1069
1   order    U239012343     P0006018073         1   1680
2   order  U10007697373     P0002267974         1    285
3   order    U296328517     P0016144236         1    550
4   order    U300884570  P0014516980122         1    249
5   order    U451050374     P0004134266         1   1780
6   order    U465124055     P0012662252         1    488
7   order    U403001364     P0004401294         1    276
8   order    U465123247     P0000319874         1   2199
9   order    U311808547     P0006944501         1   1069
10  order    U178630660     P0003248055         1    799
11  order    U339736346     P0018924850         2    792
12  order    U465125772     P0013850723         1   2980
13  order    U465125671     P0003448524         2    390

In [152]:
import sqlite3 as lite

with lite.connect('customer.sqlite') as con:
    orders.to_sql('orders', con=con)

In [153]:
import sqlite3 as lite
import pandas as pd

with lite.connect('customer.sqlite') as con:
    df = pd.read_sql_query('SELECT * FROM orders where Price is not null order by Price desc limit 3;', con)
df

,index,Dates,Action,User,Product,Quantity,Price
0,5435,2015-07-03 16:01:57,order,U10120098943,P0000143500,1,438888.0
1,28211,2015-07-16 17:05:30,order,U10062834851,P0000143511,1,438888.0
2,30496,2015-07-17 17:57:13,order,U10120098943,P0000143511,1,438888.0

## 在黑黑的畫面下打入
- conda install html5lib
- conda install lxml

In [4]:
import pandas
dfs = pandas.read_html('http://www.twse.com.tw/ch/trading/fund/BFI82U/BFI82U.php')

In [12]:
dfs[7]

1                        單位名稱         買進金額         賣出金額        買賣差額
0  105年08月25日  三大法人買賣金額統計表(元)          NaN          NaN         NaN
1                        單位名稱         買進金額         賣出金額        買賣差額
2                   自營商(自行買賣)    981567708   1127943360  -146375652
3                     自營商(避險)   4884645761   4992512753  -107866992
4                          投信   1063973140    862172569   201800571
5                       外資及陸資  25380126852  17413257537  7966869315
6                          合計  32310313461  24395886219  7914427242

In [13]:
stock = dfs[7]
stock.columns = stock.iloc[1]

In [14]:
stock = stock.drop([0,1,6])

In [15]:
stock

1       單位名稱         買進金額         賣出金額        買賣差額
2  自營商(自行買賣)    981567708   1127943360  -146375652
3    自營商(避險)   4884645761   4992512753  -107866992
4         投信   1063973140    862172569   201800571
5      外資及陸資  25380126852  17413257537  7966869315

In [26]:
stocklist = []
for d in range(1,25):
    dt = '105%2F08%2F' + str(d +100)[1:]
    try:
        dfs = pandas.read_html('http://www.twse.com.tw/ch/trading/fund/BFI82U/BFI82U.php?report1=day&input_date={}&mSubmit=%ACd%B8%DF'.format(dt))
        stock = dfs[7]
        stock.columns = stock.iloc[1]
        stock = stock.drop([0,1,6])
        stock['date'] = '2016/8/'+ str(d)
        stocklist.append(stock)
        print(d)
    except:
        pass

1
2
3
4
5
8
9
10
11
12
15
16
17
18
19
22
23
24

In [27]:
import pandas as pd
stockdf = pd.concat(stocklist)
stockdf

1        單位名稱         買進金額         賣出金額         買賣差額       date
2   自營商(自行買賣)   1080070920   1497536485   -417465565   2016/8/1
3     自營商(避險)   4123724718   5238698756  -1114974038   2016/8/1
4          投信   1205828669    814983836    390844833   2016/8/1
5       外資及陸資  31442838676  18865359974  12577478702   2016/8/1
2   自營商(自行買賣)   1205306510    991637000    213669510   2016/8/2
3     自營商(避險)   3691487558   4765081466  -1073593908   2016/8/2
4          投信   1138656086   1460791140   -322135054   2016/8/2
5       外資及陸資  21043754323  17487984947   3555769376   2016/8/2
2   自營商(自行買賣)   1209281720    998519760    210761960   2016/8/3
3     自營商(避險)   4002706525   4527293035   -524586510   2016/8/3
4          投信    976116220   1307571320   -331455100   2016/8/3
5       外資及陸資  18836061488  21392644036  -2556582548   2016/8/3
2   自營商(自行買賣)   1299533120   1541780245   -242247125   2016/8/4
3     自營商(避險)   3532520070   5469841081  -1937321011   2016/8/4
4          投信   1003776690   1227157258   -223380568   2016/8/4
5       外資及陸資  19924201135  18179074738   1745126397   2016/8/4
2   自營商(自行買賣)   1140100040   1286616950   -146516910   2016/8/5
3     自營商(避險)   3701617576   5773348103  -2071730527   2016/8/5
4          投信    904306050   1383295447   -478989397   2016/8/5
5       外資及陸資  28577715671  16551264193  12026451478   2016/8/5
2   自營商(自行買賣)    961757861   1019070345    -57312484   2016/8/8
3     自營商(避險)   4470979603   4562468967    -91489364   2016/8/8
4          投信   1193599240    973899800    219699440   2016/8/8
5       外資及陸資  23682285405  17982894775   5699390630   2016/8/8
2   自營商(自行買賣)   1031870817   1346162324   -314291507   2016/8/9
3     自營商(避險)   3453122976   5322204732  -1869081756   2016/8/9
4          投信    874813150   1359461940   -484648790   2016/8/9
5       外資及陸資  24957871422  18374388835   6583482587   2016/8/9
2   自營商(自行買賣)   1074383954   1509623325   -435239371  2016/8/10
3     自營商(避險)   3784125407   4459344807   -675219400  2016/8/10
..        ...          ...          ...          ...        ...
4          投信    876305930    849135580     27170350  2016/8/15
5       外資及陸資  22381823631  18919941410   3461882221  2016/8/15
2   自營商(自行買賣)   1149926043    940430366    209495677  2016/8/16
3     自營商(避險)   4307632689   7371213852  -3063581163  2016/8/16
4          投信   1032979590   1089630367    -56650777  2016/8/16
5       外資及陸資  25105335791  25500324600   -394988809  2016/8/16
2   自營商(自行買賣)   1230330376   2030744964   -800414588  2016/8/17
3     自營商(避險)   4059075416   6506881455  -2447806039  2016/8/17
4          投信    991480390   1129027400   -137547010  2016/8/17
5       外資及陸資  26668537682  23007064700   3661472982  2016/8/17
2   自營商(自行買賣)   1101745585    908497575    193248010  2016/8/18
3     自營商(避險)   4763489490   4741710888     21778602  2016/8/18
4          投信    874845330    961559261    -86713931  2016/8/18
5       外資及陸資  25372460289  20769265886   4603194403  2016/8/18
2   自營商(自行買賣)   1241761054   1245962495     -4201441  2016/8/19
3     自營商(避險)   4749316943   5374756189   -625439246  2016/8/19
4          投信    640347630   1655044022  -1014696392  2016/8/19
5       外資及陸資  22213625833  26058855264  -3845229431  2016/8/19
2   自營商(自行買賣)    890856225    899139296     -8283071  2016/8/22
3     自營商(避險)   4849880976   3987910415    861970561  2016/8/22
4          投信    591347750   1524288414   -932940664  2016/8/22
5       外資及陸資  18313886405  20896054133  -2582167728  2016/8/22
2   自營商(自行買賣)   1127496797    696726293    430770504  2016/8/23
3     自營商(避險)   4934221970   3700371442   1233850528  2016/8/23
4          投信    777321300   1223396773   -446075473  2016/8/23
5       外資及陸資  21115802183  21231721514   -115919331  2016/8/23
2   自營商(自行買賣)   1036455420   1025371310     11084110  2016/8/24
3     自營商(避險)   3720737521   4101104213   -380366692  2016/8/24
4          投信    951977150   1037709370    -85732220  2016/8/24
5       外資及陸資  15670116537  16018839393   -348722856  2016/8/24

[72 rows x 5 columns]

In [30]:
stockdf[stockdf[u'單位名稱'] == u'外資及陸資'].to_excel('foreign.xlsx')

## Datetime
- https://docs.python.org/3.5/library/datetime.html#strftime-and-strptime-behavior

In [2]:
from datetime import datetime
dt = datetime.now()
type(dt)

datetime.datetime

In [3]:
dt.strftime('%Y/%m/%d')

'2016/08/25'

In [4]:
dt.strftime('%Y/%m/%d %B')

'2016/08/25 August'

In [6]:
d = '2015-08-11'
d2  = datetime.strptime(d, '%Y-%m-%d')
print(d2)
type(d2)

2015-08-11 00:00:00

datetime.datetime

In [8]:
dt = datetime.now()
d = '1990-05-11'
d2  = datetime.strptime(d, '%Y-%m-%d')

dt - d2

datetime.timedelta(9603, 58097, 36122)

In [11]:
from datetime import timedelta
dt - timedelta(days = 1)

datetime.datetime(2016, 8, 24, 16, 8, 17, 36122)

In [21]:
for i in range(1,30):
    #print(dt - timedelta(days = i))
    #print((dt - timedelta(days = i)).strftime('%Y%m%d'))
    
    #print((dt - timedelta(days = i)).strftime('%Y/%m/%d'))
    year, md = ((dt - timedelta(days = i)).strftime('%Y/%m/%d').split('/',1))
    print('{}/{}'.format(int(year)-1911, md))

105/08/24
105/08/23
105/08/22
105/08/21
105/08/20
105/08/19
105/08/18
105/08/17
105/08/16
105/08/15
105/08/14
105/08/13
105/08/12
105/08/11
105/08/10
105/08/09
105/08/08
105/08/07
105/08/06
105/08/05
105/08/04
105/08/03
105/08/02
105/08/01
105/07/31
105/07/30
105/07/29
105/07/28
105/07/27

In [ ]:
from datetime import datetime, timedelta
import pandas
stocklist = []
cdt = datetime.now()
for i in range(1,30):
    y, m,d = ((cdt - timedelta(days = i)).strftime('%Y/%m/%d').split('/'))
    dt = '{}%2f{}%2f{}'.format(int(y)-1911, m,d)
    print(dt)
    try:
        dfs = pandas.read_html('http://www.twse.com.tw/ch/trading/fund/BFI82U/BFI82U.php?report1=day&input_date={}&mSubmit=%ACd%B8%DF'.format(dt))
        stock = dfs[7]
        stock.columns = stock.iloc[1]
        stock = stock.drop([0,1,6])
        stock['date'] = dt
        stocklist.append(stock)
        print(dt)
    except:
        pass

105%2f08%2f24
105%2f08%2f24
105%2f08%2f23
105%2f08%2f23
105%2f08%2f22
105%2f08%2f22
105%2f08%2f21
105%2f08%2f20
105%2f08%2f19
105%2f08%2f19
105%2f08%2f18
105%2f08%2f18
105%2f08%2f17
105%2f08%2f16
105%2f08%2f16
105%2f08%2f15
105%2f08%2f15
105%2f08%2f14
105%2f08%2f13
105%2f08%2f12
105%2f08%2f12
105%2f08%2f11
105%2f08%2f11

In [3]:
import pandas
df = pandas.read_csv('data/part1.txt', encoding = 'utf-8', sep= '\t', na_values='?', header=None)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2852704 entries, 0 to 2852703
Data columns (total 14 columns):
0     object
1     float64
2     float64
3     int64
4     int64
5     int64
6     int64
7     float64
8     float64
9     object
10    object
11    float64
12    float64
13    float64
dtypes: float64(7), int64(4), object(3)
memory usage: 326.5+ MB

In [6]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,f23e7f226f504677a4ca890cd296413f,21,0,69,171,0,0,22.6333,120.350006,Kaohsiung,Taiwan,3,3.41,0
1,f1a44ccf03b9465c918325d6e0752176,1,0,0,1,0,0,25.0392,121.524994,Taipei,Taiwan,13,11.95,0
2,2662293ab50743ae9a0ff1940fdecca3,3,0,1,2,0,0,25.0392,121.524994,Taipei,Taiwan,9,7.73,NaN
3,ef24f613991e4c618aa2e57a3ddd0a52,1,0,0,7,0,0,25.0392,121.524994,Taipei,Taiwan,16,9.59,0
4,f327275a8dbd406c8aacf4fb809a9b92,1,0,0,0,1,0,23.5000,121.000000,NaN,Taiwan,1,0.26,0

In [7]:
df.columns = ['cookie_id','週間造訪次數','週末造訪次數','早上造訪次數','下午造訪次數','晚上造訪次數','凌晨造訪次數','Latitude','Longitude',
 'City','Country','AVG_PAGE','ACTIVE_TIME','oneline_visit']

In [9]:
df.head()

,cookie_id,週間造訪次數,週末造訪次數,早上造訪次數,下午造訪次數,晚上造訪次數,凌晨造訪次數,Latitude,Longitude,City,Country,AVG_PAGE,ACTIVE_TIME,oneline_visit
0,f23e7f226f504677a4ca890cd296413f,21,0,69,171,0,0,22.6333,120.350006,Kaohsiung,Taiwan,3,3.41,0
1,f1a44ccf03b9465c918325d6e0752176,1,0,0,1,0,0,25.0392,121.524994,Taipei,Taiwan,13,11.95,0
2,2662293ab50743ae9a0ff1940fdecca3,3,0,1,2,0,0,25.0392,121.524994,Taipei,Taiwan,9,7.73,NaN
3,ef24f613991e4c618aa2e57a3ddd0a52,1,0,0,7,0,0,25.0392,121.524994,Taipei,Taiwan,16,9.59,0
4,f327275a8dbd406c8aacf4fb809a9b92,1,0,0,0,1,0,23.5000,121.000000,NaN,Taiwan,1,0.26,0

In [12]:
df[df['Country'] == 'Taiwan']['Country'].count()

2655328

In [13]:
df.groupby('Country')['cookie_id'].count()

Country
Afghanistan                           1
Albania                               2
Algeria                               1
American Samoa                        2
Anguilla                              2
Anonymous Proxy                      24
Antigua and Barbuda                   4
Argentina                            38
Armenia                               1
Asia/Pacific Region                3111
Australia                          5922
Austria                             162
Bangladesh                           35
Barbados                              1
Belarus                               2
Belgium                             101
Belize                                7
Bermuda                               2
Bhutan                                1
Bolivia                               5
Bosnia and Herzegovina                1
Brazil                              163
Brunei Darussalam                    10
Bulgaria                             10
Burkina Faso                         18
Cambodia                            668
Cameroon                              3
Canada                             4126
Chad                                  9
Chile                                62
                                 ...
Saudi Arabia                         99
Senegal                               2
Seychelles                            3
Singapore                          3378
Slovakia                             29
Slovenia                             14
Solomon Islands                       8
South Africa                        159
Spain                              1109
Sri Lanka                            28
Swaziland                            15
Sweden                              127
Switzerland                         242
Taiwan                          2655328
Tanzania, United Republic of          4
Thailand                           1810
Togo                                  2
Tonga                                 1
Trinidad and Tobago                   5
Tunisia                               8
Turkey                             1457
Uganda                                1
Ukraine                               8
United Arab Emirates                164
United Kingdom                     1981
United States                     99969
Uruguay                               1
Venezuela                            15
Vietnam                            3036
Virgin Islands, British               1
Name: cookie_id, dtype: int64

In [15]:
df.groupby('Country')['cookie_id'].count().sort_values(ascending=False)[0:30]

Country
Taiwan                 2655328
United States            99969
China                    27419
Japan                    10383
Hong Kong                 8225
Australia                 5922
Canada                    4126
Singapore                 3378
Asia/Pacific Region       3111
Vietnam                   3036
Korea, Republic of        2459
United Kingdom            1981
Malaysia                  1876
Philippines               1856
Thailand                  1810
Turkey                    1457
Italy                     1163
Germany                   1112
Spain                     1109
Lithuania                 1084
Macau                     1041
Norway                    1028
New Zealand                883
Indonesia                  816
France                     776
Cambodia                   668
Netherlands                556
Russian Federation         555
India                      525
Switzerland                242
Name: cookie_id, dtype: int64

In [16]:
df[df['Country']=='Taiwan'].groupby('City')['週間造訪次數'].mean().sort_values(ascending=False)[0:30]

City
Shoufeng       8.500000
Qiaotou        7.365385
Touliu         7.103448
Tawan          6.909091
Minhsiung      6.538462
Beihe          6.183673
Chunan         6.157895
Caoya          6.102041
Beiping        6.000000
Sanhsia        5.962963
Chengxing      5.897959
Puli           5.779365
Feny黙n         5.696429
Pate           5.434783
Chiai          5.386792
Chushui        5.358209
Sinjhuang      5.238636
Luodong        5.237736
Omei           5.166667
Suao           5.157534
Neihu          5.061856
Tachi          4.750000
Gushan         4.600000
Penghu         4.545455
Chang Hwa      4.545031
Shetou         4.543210
Nanqu          4.512308
Taishan        4.439560
Zuo Ying Qu    4.425804
Lukang         4.406680
Name: 週間造訪次數, dtype: float64

In [18]:
df['週間Total_View'] = df['週間造訪次數'] * df['AVG_PAGE']

In [19]:
df.head()

,cookie_id,週間造訪次數,週末造訪次數,早上造訪次數,下午造訪次數,晚上造訪次數,凌晨造訪次數,Latitude,Longitude,City,Country,AVG_PAGE,ACTIVE_TIME,oneline_visit,週間Total_View
0,f23e7f226f504677a4ca890cd296413f,21,0,69,171,0,0,22.6333,120.350006,Kaohsiung,Taiwan,3,3.41,0,63
1,f1a44ccf03b9465c918325d6e0752176,1,0,0,1,0,0,25.0392,121.524994,Taipei,Taiwan,13,11.95,0,13
2,2662293ab50743ae9a0ff1940fdecca3,3,0,1,2,0,0,25.0392,121.524994,Taipei,Taiwan,9,7.73,NaN,27
3,ef24f613991e4c618aa2e57a3ddd0a52,1,0,0,7,0,0,25.0392,121.524994,Taipei,Taiwan,16,9.59,0,16
4,f327275a8dbd406c8aacf4fb809a9b92,1,0,0,0,1,0,23.5000,121.000000,NaN,Taiwan,1,0.26,0,1

In [22]:
df.groupby('City')['週間Total_View'].sum().sort_values(ascending=False)[0:10]

City
Taipei       28890698
Taichung      3876761
Kaohsiung     2152742
Taoy黙n        1559778
Tainan        1258266
Hsinchu       1006075
Changhua       431331
Boardman       228620
Keelung        161158
Seattle        122659
Name: 週間Total_View, dtype: float64

In [23]:
import pandas
df2 = pandas.read_csv('data/part2.txt', encoding = 'big5', sep= '\t')

In [24]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2852704 entries, 0 to 2852703
Data columns (total 62 columns):
cookie_id         object
線上開戶              object
線上申請房貸            object
線上申辦信用卡           object
申請預借現金分期          object
調升信用卡額度           object
線上申請信貸            object
線上確認信貸契約          object
卡友權益_白金卡紅利2倍回饋    object
卡友權益_保障           object
卡友權益_旅遊           object
卡友權益_理財           object
卡友權益_超值保險         object
卡友權益_購物           object
卡片介紹_i刷卡          object
卡片介紹_手機信用卡        object
卡片介紹_我的最佳信用卡      object
卡片介紹_虛擬卡          object
卡片介紹_銀行卡          object
卡片介紹_銀行聯名卡        object
卡片介紹_聯名卡          object
紅利兌換_生活費用         object
紅利兌換_交通           object
紅利兌換_休閒           object
紅利兌換_保障           object
紅利兌換_旅遊           object
紅利兌換_消費折抵         object
紅利兌換_健康           object
紅利兌換_慈善           object
紅利兌換_購物           object
優惠精選_人氣精選         object
優惠精選_世界逍遙遊        object
優惠精選_休閒           object
優惠精選_旅遊           object
優惠精選_餐飲           object
信用卡               object
房貸                object
企業金融              object
信貸                object
其他貸款              object
服務據點查詢            object
基金及理財商品數          object
理財諮詢與試算           object
信用卡_卡片介紹          object
繳費/付款服務           object
台幣存款_產品介紹         object
申辦帳戶自動扣繳          object
台幣存款_試算           object
台幣存款_存放款利率查詢      object
台幣存款_即時存放款利率查詢    object
台幣存款_歷史存放款利率查詢    object
外匯_貸款利率造訪次數       object
外匯_存款利率           object
外匯_即時匯率           object
外匯_歷史匯率           object
外匯_匯率試算           object
壽險服務              object
產險服務造訪次數          object
證券服務造訪次數          object
外匯_產品介紹造訪次數       object
外匯_匯款服務介紹造訪次數     object
外匯_現鈔/旅支造訪次數      object
dtypes: object(62)
memory usage: 1.3+ GB

In [26]:
df2.head()

,cookie_id,線上開戶,線上申請房貸,線上申辦信用卡,申請預借現金分期,調升信用卡額度,線上申請信貸,線上確認信貸契約,卡友權益_白金卡紅利2倍回饋,卡友權益_保障,...,外匯_存款利率,外匯_即時匯率,外匯_歷史匯率,外匯_匯率試算,壽險服務,產險服務造訪次數,證券服務造訪次數,外匯_產品介紹造訪次數,外匯_匯款服務介紹造訪次數,外匯_現鈔/旅支造訪次數
0,49c525096f0a46b491af81049043c7f4,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,9a66b7f384224d37a32a307d9b35f498,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,b112ede972bb4ed4a68a665613fc4776,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,f0b804552db241a780a8b758c069c3ef,0,0,0,0,0,0,0,0,0,...,0,2,0,0,0,0,0,0,0,0
4,5ce527a65d544c7c900831fc088e7411,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [28]:
import pandas as pd
df3 = pd.merge(df, df2, on=['cookie_id'], how='inner')

C:\Anaconda2\lib\site-packages\pandas\core\index.py:1907: UnicodeWarning: Unicode equal comparison failed to convert both arguments to Unicode - interpreting them as being unequal
  indexer = self._engine.get_indexer(target._values)
C:\Anaconda2\lib\site-packages\pandas\core\index.py:1122: UnicodeWarning: Unicode equal comparison failed to convert both arguments to Unicode - interpreting them as being unequal
  return key in self._engine

In [29]:
df3.head()

,cookie_id,週間造訪次數,週末造訪次數,早上造訪次數,下午造訪次數,晚上造訪次數,凌晨造訪次數,Latitude,Longitude,City,...,外匯_存款利率,外匯_即時匯率,外匯_歷史匯率,外匯_匯率試算,壽險服務,產險服務造訪次數,證券服務造訪次數,外匯_產品介紹造訪次數,外匯_匯款服務介紹造訪次數,外匯_現鈔/旅支造訪次數
0,f23e7f226f504677a4ca890cd296413f,21,0,69,171,0,0,22.6333,120.350006,Kaohsiung,...,0,0,0,0,0,0,0,0,0,0
1,f1a44ccf03b9465c918325d6e0752176,1,0,0,1,0,0,25.0392,121.524994,Taipei,...,0,0,0,0,0,0,0,0,0,0
2,2662293ab50743ae9a0ff1940fdecca3,3,0,1,2,0,0,25.0392,121.524994,Taipei,...,?,?,?,?,?,?,?,?,?,?
3,ef24f613991e4c618aa2e57a3ddd0a52,1,0,0,7,0,0,25.0392,121.524994,Taipei,...,0,0,0,0,1,0,0,0,0,0
4,f327275a8dbd406c8aacf4fb809a9b92,1,0,0,0,1,0,23.5000,121.000000,NaN,...,0,0,0,0,0,0,0,0,0,0